Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: 2to3 - Automated Python 2 to 3 code translation
pl: 2to3 Zautomatyzowany tłumacz kodu z języka pytonowskiego w wersji 2 do wersji 3

source: 2to3 is a Python program that reads Python 2.x source code and applies a series of *fixers* to transform it into valid Python 3.x code. The standard library contains a rich set of fixers that will handle almost all code. 2to3 supporting library :mod:`lib2to3` is, however, a flexible and generic library, so it is possible to write your own fixers for 2to3. :mod:`lib2to3` could also be adapted to custom applications in which Python code needs to be edited automatically.
pl: 2to3 jest programem języka pytonowskiego który wczytuje kod źródłowy języka pytonowskiego 2.x i zastosowuje serię *ulepszeń* aby przełożyć go do poprawnej postaci kodu języka pytonowskiego 3.x. Standardowa biblioteka zawiera bogaty zbiór ulepszeń które przełożą prawie cały kod. biblioteka wspierająca 2to3 :mod:`lib2to3` jest jednakże elastyczną i podstawową biblioteką, więc jest możliwe napisanie swoich własnych ulepszeń dla 2to3. :mod:`lib2to3` może być także przystosowana do szczególnych aplikacji w których kod języka pytonowskiego miałby być edytowany automatycznie

source: Using 2to3
pl: Użycie 2to3

source: 2to3 will usually be installed with the Python interpreter as a script. It is also located in the :file:`Tools/scripts` directory of the Python root.
pl: 2to3 jest zwykle instalowane z programem interpretującym polecenia języka pytonowskiego jako skrypt. Jest też umieszczone w podkatalogu :file:`Tools/scripts` drzewa katalogowego języka pytonowskiego

source: 2to3's basic arguments are a list of files or directories to transform. The directories are to recursively traversed for Python sources.
pl: podstawowymi argumentami 2to3 jest lista plików lub katalogów to zamiany. Podkatalogi są przeszukiwane rekursywnie w poszukiwaniu plików źródłowych języka pytonowskiego.

source: Here is a sample Python 2.x source file, :file:`example.py`::
pl: Oto przykład pliku źródłowego napisanego w języku pytonowskim w wersji 2.x - :file:`example.py`::

source: def greet(name): print "Hello, {0}!".format(name) print "What's your name?" name = raw_input() greet(name)
pl: def greet(name):print "Cześć, {0}!".format(name) print "Jak masz na imię?" name = raw_input() greet(name)

source: It can be converted to Python 3.x code via 2to3 on the command line::
pl: Można to zamienić na kod w języku pytonowskim w wersji 3.x przez 2to3 w linii poleceń::

source: A diff against the original source file is printed. 2to3 can also write the needed modifications right back to the source file. (A backup of the original file is made unless :option:`-n` is also given.) Writing the changes back is enabled with the :option:`-w` flag::
pl: Wypisywane są różnice względem pierwotnego pliku źródłowego. 2to3 może też zapisać oczekiwane modyfikacje wprost do pliku źródłowego. (Jest sporządzana kopia zapasowa pliku źródłowego, chyba że wywołanie nastąpiło z opcją :option:`-n`.) Zapis zmian do pliku źródłowego jest możliwy z flagą :option:`-w`::

source: After transformation, :file:`example.py` looks like this::
pl: Po transformacji, plik :file:`example.py` wygląda następująco::

source: def greet(name): print("Hello, {0}!".format(name)) print("What's your name?") name = input() greet(name)
pl: def greet(name): print("Cześć, {0}!".format(name)) print("Jak masz na imię?") name = input() greet(name)

source: Comments and exact indentation are preserved throughout the translation process.
pl: Komentarze i dokładne wcięcia są zachowywane podczas procesu tłumaczenia

source: By default, 2to3 runs a set of :ref:`predefined fixers <2to3-fixers>`. The :option:`-l` flag lists all available fixers. An explicit set of fixers to run can be given with :option:`-f`. Likewise the :option:`-x` explicitly disables a fixer. The following example runs only the ``imports`` and ``has_key`` fixers::
pl: Domyślnie, 2to3 wykonuje serię `predefiniowanych przekształceń <2to3-fixers>`. Przełącznik :option:`-l` wypisuje wszystkie dostępne przekształcenia. Precyzyjny zestaw przekształceń do wykonania może zostać podany po parametrze :option:`-f`. Podobnie przełącznik :option:`-x` wyraźnie wyłącza przekształcenie. Następujący przykład uruchamia tylko przekształcenia ``imports`` i ``has_key``::

source: This command runs every fixer except the ``apply`` fixer::
pl: Ta komenda uruchamia każde przekształcenie oprócz przekształcenia ``apply``::

source: Some fixers are *explicit*, meaning they aren't run by default and must be listed on the command line to be run. Here, in addition to the default fixers, the ``idioms`` fixer is run::
pl: Niektóre przekształcenia są *szczególne*, co oznacza że nie są uruchamiane domyślnie i muszą być wymienione w linii poleceń aby zostać uruchomionymi. Tutaj w uzupełnieniu domyślnych przekształceń, przekształcenie ``idioms`` jest uruchamiane::

source: Notice how passing ``all`` enables all default fixers.
pl: Zauważ, że przekazanie ``all`` włącza wszystkie domyślne przekształcenia.

source: Sometimes 2to3 will find a place in your source code that needs to be changed, but 2to3 cannot fix automatically. In this case, 2to3 will print a warning beneath the diff for a file. You should address the warning in order to have compliant 3.x code.
pl: Czasami 2to3 znajduje miejsce w twoim kodzie źródłowym które potrzebuje zmiany, ale 2to3 nie może go zmienić automatycznie. W takim przypadku, 2to3 wypisuje ostrzeżenie poniżej różnicy dla pliku. Powinieneś odpowiedzieć na ostrzeżenie w celu zapewnienia kodu zgodnego z wersją 3.x.

source: 2to3 can also refactor doctests. To enable this mode, use the :option:`-d` flag. Note that *only* doctests will be refactored. This also doesn't require the module to be valid Python. For example, doctest like examples in a reST document could also be refactored with this option.
pl: 2to3 może także poprawiać dokumenty typu doctest. Aby umożliwić ten tryb, użyj przełącznika :option:`-d`. Zauważ że *tylko* dokumenty doctest zostaną poprawione. Nie jest także wymagane aby moduł był prawidłowym plikiem Pythona. Na przykład, przykłady doctest w dokumencie reST mogą też być poprawiane przy użyciu tej opcji.

source: The :option:`-v` option enables output of more information on the translation process.
pl: opcja :option:`-v` włącza wypisywanie większej ilości informacji o procesie tłumaczenia.

source: Since some print statements can be parsed as function calls or statements, 2to3 cannot always read files containing the print function. When 2to3 detects the presence of the ``from __future__ import print_function`` compiler directive, it modifies its internal grammar to interpert :func:`print` as a function. This change can also be enabled manually with the :option:`-p` flag. Use :option:`-p` to run fixers on code that already has had its print statements converted.
pl: Od kiedy niektóre polecenia print można wczytywać jako odwołania do zadania lub polecenia, 2to3 nie zawsze może wczytać pliki zawierające zadanie print. Gdy 2to3 wykryje obecność dyrektywy kompilatora``from __future__ import print_function``, modyfikuje swoją wewnętrzną gramatykę aby interpretować :func:`print` jako zadanie. Ta zmiana może także być włączana ręcznie przy użyciu przełącznika :option:`-p`. Użyj :option:`-p` aby uruchomić przekształcenia na kodzie na którym uprzednio wykonano konwersję poleceń print.

source: Fixers
pl: Przekształcenia

source: Each step of transforming code is encapsulated in a fixer. The command ``2to3 -l`` lists them. As :ref:`documented above <2to3-using>`, each can be turned on and off individually. They are described here in more detail.
pl: Każdy krok transformacji kodu jest zawarty w jednym przekształceniu. Polecenie ``2to3 -l`` wypisuje je. Jak :ref:`udokumentowano powyżej <2to3-using>`, każde przekształcenie może być włączane i wyłączane indywidualnie. Są tu opisane w większych szczegółach.

source: Removes usage of :func:`apply`. For example ``apply(function, *args, **kwargs)`` is converted to ``function(*args, **kwargs)``.
pl: Wyłącza użycie zadania :func:`apply`. Na przykład ``apply(function, *args, **kwargs)`` jest zamieniane na ``function(*args, **kwargs)``.

source: Converts :class:`basestring` to :class:`str`.
pl: Zamienia :class:`basestring` na :class:`str`.

source: Converts :class:`buffer` to :class:`memoryview`. This fixer is optional because the :class:`memoryview` API is similar but not exactly the same as that of :class:`buffer`.
pl: Zamienia uogólnienie :class:`buffer` na :class:`memoryview`. To przekształcenie jest nieobowiązkowe ponieważ sprzęg programowwania aplikacji ( - z ang. - API) uogólnienia :class:`memoryview` jest podobny choć nie dokładnie taki sam jak ten z uogólnienia :class:`buffer`.

source: Converts ``callable(x)`` to ``isinstance(x, collections.Callable)``, adding an import to :mod:`collections` if needed.
pl: Zamienia ``callable(x)`` na ``isinstance(x,collections.Callable)``, dodając import do :mod:`collections` jeśli trzeba.

source: Fixes dictionary iteration methods. :meth:`dict.iteritems` is converted to :meth:`dict.items`, :meth:`dict.iterkeys` to :meth:`dict.keys`, and :meth:`dict.itervalues` to :meth:`dict.values`. Similarly, :meth:`dict.viewitems`, :meth:`dict.viewkeys` and :meth:`dict.viewvalues` are converted respectively to :meth:`dict.items`, :meth:`dict.keys` and :meth:`dict.values`. It also wraps existing usages of :meth:`dict.items`, :meth:`dict.keys`, and :meth:`dict.values` in a call to :class:`list`.
pl: Naprawia metody iterujące słowniki. :meth:`dict.iteritems` jest zamieniane na :meth:`dict.items`, :meth:`dict.iterkeys` na :meth:`dict.keys`, i :meth:`dict.itervalues` na :meth:`dict.values`. Podobnie, :meth:`dict.viewitems`, :meth:`dict.viewkeys` i :meth:`dict.viewvalues` są konwertowane odpowienio do :meth:`dict.items`, :meth:`dict.keys` i :meth:`dict.values`. Opakowuje też istniejące użycia :meth:`dict.items`, :meth:`dict.keys`, i :meth:`dict.values` w wywołaniu :class:`list`.

source: Converts ``except X, T`` to ``except X as T``.
pl: Zamienia ``except X, T`` na ``except X as T``.

source: Converts the :keyword:`exec` statement to the :func:`exec` function.
pl: Zamienia wyrażenie :keyword:`exec` na zadanie :func:`exec`.

source: Removes usage of :func:`execfile`. The argument to :func:`execfile` is wrapped in calls to :func:`open`, :func:`compile`, and :func:`exec`.
pl: Usuwa użycie :func:`execfile`. Argument :func:`execfile` jest opakowywany w wywołanie zadania :func:`open`, :func:`compile`, i :func:`exec`.

source: Changes assignment of :attr:`sys.exitfunc` to use of the :mod:`atexit` module.
pl: Zmienia przypisanie właściwości :attr:`sys.exitfunc` dla użycia modułu :mod:`atexit`.

source: Wraps :func:`filter` usage in a :class:`list` call.
pl: Opakowuje zadanie :func:`filter` w wywołanie uogólnienia :class:`list`.

source: Fixes function attributes that have been renamed. For example, ``my_function.func_closure`` is converted to ``my_function.__closure__``.
pl: Naprawia właściwości zadania których nazwy zostały zmienione. Na przykład, ``my_function.func_closure`` jest zamieniana na ``my_function.__closure__``.

source: Removes ``from __future__ import new_feature`` statements.
pl: Usuwa wyrażenia ``from __future__ import new_feature`.

source: Renames :func:`os.getcwdu` to :func:`os.getcwd`.
pl: Zmienia funkcję :func:`os.getcwdu` na :func:`os.getcwd`.

source: Changes ``dict.has_key(key)`` to ``key in dict``.
pl: Zmienia ``dict.has_key(key)`` na ``key in dict``.

source: This optional fixer performs several transformations that make Python code more idiomatic. Type comparisons like ``type(x) is SomeClass`` and ``type(x) == SomeClass`` are converted to ``isinstance(x, SomeClass)``. ``while 1`` becomes ``while True``. This fixer also tries to make use of :func:`sorted` in appropriate places. For example, this block ::
pl: To opcjonalne przekształcenie wykonuje kilka transformacji które czynią kod języka pytonowskiego bardziej idiomatycznym. Porównania typów takie jak ``type(x) is PewneUogolnienie`` i ``type(x) == PewneUogolnienie`` są przekształcane na ``isinstance(x, PewneUogolnienie)``. ``while 1`` staje się ``while True``. Ta poprawka także próbuje użyć zadania :func:`sorted` we właściwych miejscach. Na przykład, ten blok::

source: L = list(some_iterable) L.sort()
pl: L = list(pewne_iterowalne) L.sort()

source: is changed to ::
pl: jest zamieniany na ::

source: L = sorted(some_iterable)
pl: L = sorted(pewne_iterowalne)

source: Detects sibling imports and converts them to relative imports.
pl: Wykrywa pokrewne importowania i przekształca je na względne importowania.

source: Handles module renames in the standard library.
pl: Obsługuje zmiany nazw modułów w bibliotece standardowej.

source: Handles other modules renames in the standard library. It is separate from the :2to3fixer:`imports` fixer only because of technical limitations.
pl: Zarządza zmianami nazw innych modułów w bibliotece standardowej. Jest oddzielony od przekształcenia :2to3fixer:`imports` tylko z powodu ograniczeń technicznych.

source: Converts ``input(prompt)`` to ``eval(input(prompt))``
pl: Zamienia ``input(prompt)`` na ``eval(input(prompt))``

source: Converts :func:`intern` to :func:`sys.intern`.
pl: Zamienia :func:`intern` na :func:`sys.intern`.

source: Fixes duplicate types in the second argument of :func:`isinstance`. For example, ``isinstance(x, (int, int))`` is converted to ``isinstance(x, (int))``.
pl: Poprawia zduplikowanie typu w drugim parametrze zadania :func:`isinstance`. Na przykład, ``isinstance(x, (int,int))`` jest zamieniane na ``isinstance(x, (int))

source: Removes imports of :func:`itertools.ifilter`, :func:`itertools.izip`, and :func:`itertools.imap`. Imports of :func:`itertools.ifilterfalse` are also changed to :func:`itertools.filterfalse`.
pl: Usuwa przywołania :func:`itertools.ifilter`, :func:`itertools.izip`, i :func:`itertools.imap`. Przywołania :func:`itertools.ifilterfalse` są także zamieniane na :func:`itertools.filterfalse`.

source: Changes usage of :func:`itertools.ifilter`, :func:`itertools.izip`, and :func:`itertools.imap` to their built-in equivalents. :func:`itertools.ifilterfalse` is changed to :func:`itertools.filterfalse`.
pl: Zmienia użycie funkcji :func:`itertools.ifilter`, :func:`itertools.zip`, i :func:`itertools.imap` na równoważniki wbudowane. Zadanie :func:`itertools.ifilterfalse` jest zamieniane na zadanie :func:`itertools.filterfalse`.

source: Strips the ``L`` prefix on long literals and renames :class:`long` to :class:`int`.
pl: Zabiera przedrostek ``L`` na długich literałach i zmienia nazwę uogólnienia :class:`long` na :class:`int`.

source: Wraps :func:`map` in a :class:`list` call. It also changes ``map(None, x)`` to ``list(x)``. Using ``from future_builtins import map`` disables this fixer.
pl: Opakowuje zadanie :func:`map` w wywołaniu :class:`list`. Zamienia także ``map(None, x)`` na ``list(x)``. Użycie ``from future_builtins import map`` wyłącza tą poprawkę.

source: Converts the old metaclass syntax (``__metaclass__ = Meta`` in the class body) to the new (``class X(metaclass=Meta)``).
pl: Zamienia starą składnię metaclass (``__metaclass__ = Meta`` w ciele uogólnienia) na nową (``class X(metaclass=Meta)``).

source: Fixes old method attribute names. For example, ``meth.im_func`` is converted to ``meth.__func__``.
pl: Naprawia nazwy starych właściwości sposobów postepowania. Na przykład, ``meth.im_func`` jest zamieniana na ``meth.__func__``.

source: Converts the old not-equal syntax, ``<>``, to ``!=``.
pl: Zamienia starą składnię nie-równości, ``<>``, na ``!=``.

source: Converts the use of iterator's :meth:`~iterator.next` methods to the :func:`next` function. It also renames :meth:`next` methods to :meth:`~object.__next__`.
pl: Zamienia użycie sposobu postępowania iteratora :meth:`~iterator.next` na zadanie :func:`next`. Zamienia także nazwę :meth:`next` na :meth:`~object.__next__`.

source: Renames :meth:`~object.__nonzero__` to :meth:`~object.__bool__`.
pl: Zamienia sposób postępowania :meth:`~object.__nonzero__` na :meth:`~object.__bool__`.

source: Converts octal literals into the new syntax.
pl: Zamienia literały ósemkowe na nową składnię.

source: Add extra parenthesis where they are required in list comprehensions. For example, ``[x for x in 1, 2]`` becomes ``[x for x in (1, 2)]``.
pl: Dodaje dodatkowe nawiasy, gdzie są wymagane w zrozumieniu list. Na przykład, ``[x for x in 1, 2]`` staje się ``[x for x in (1, 2)]``.

source: Converts the :keyword:`print` statement to the :func:`print` function.
pl: Zamienia wyrażenie :keyword:`print` na zadanie :func:`print`.

source: Converts ``raise E, V`` to ``raise E(V)``, and ``raise E, V, T`` to ``raise E(V).with_traceback(T)``. If ``E`` is a tuple, the translation will be incorrect because substituting tuples for exceptions has been removed in 3.0.
pl: Zamienia ``raise E, V`` na ``raise E(V)``, i ``raise E, V, T`` na ``raise E(V).with_traceback(T)``. Jeśli ``E`` jest krotką, zamiana będzie nieprawidłowa ponieważ zamiana krotek na wyjątki została usunięta w wersji 3.0

source: Converts :func:`raw_input` to :func:`input`.
pl: Zamienia zadanie :func:`raw_input` na :func:`input`.

source: Handles the move of :func:`reduce` to :func:`functools.reduce`.
pl: Obsługuje przesunięcie zadania :func:`reduce` do :func:`functools.reduce`.

source: Changes :data:`sys.maxint` to :data:`sys.maxsize`.
pl: Zamienia :data:`sys.maxint` na :data:`sys.maxsize`.

source: Replaces backtick repr with the :func:`repr` function.
pl: Zamienia cytowany repr na zadanie :func:`repr`

source: Replaces use of the :class:`set` constructor with set literals. This fixer is optional.
pl: Zamienia użycie konstruktora uogólnienia :class:`set` na literały zbiorów. Ta zamiana jest opcjonalna.

source: Renames :exc:`StandardError` to :exc:`Exception`.
pl: Zamienia nazwę wyjątku :exc:`StandardError` na :exc:`Exception`.

source: Changes the deprecated :data:`sys.exc_value`, :data:`sys.exc_type`, :data:`sys.exc_traceback` to use :func:`sys.exc_info`.
pl: Zamienia przedawnione :data:`sys.exc_value`, :data:`sys.exc_type`, :data:`sys.exc_traceback` aby używać :func:`sys.exc_info`.

source: Fixes the API change in generator's :meth:`throw` method.
pl: Naprawia zmianę sprzęgu API w generatorze sposobu postępowania :meth:`throw`.

source: Removes implicit tuple parameter unpacking. This fixer inserts temporary variables.
pl: Usuwa niejawny parametr krotki odpakowania. Ta poprawka wstawia tymczasowe zmienne.

source: Fixes code broken from the removal of some members in the :mod:`types` module.
pl: Naprawia kod popsuty z powodu usunięcia niektórych członków modułu :mod:`types`.

source: Renames :class:`unicode` to :class:`str`.
pl: Zamienia nazwę uogólnienia :class:`unicode` na :class:`str`.

source: Handles the rename of :mod:`urllib` and :mod:`urllib2` to the :mod:`urllib` package.
pl: Obsługuje zmianę nazwy :mod:`urllib` i :mod:`urllib2` na pakiet :mod:`urllib`.

source: Removes excess whitespace from comma separated items. This fixer is optional.
pl: Usuwa nadmiarowe białe znaki z rozdzielonych przecinkiem elementów. Ta poprawka jest opcjonalna.

source: Renames :func:`xrange` to :func:`range` and wraps existing :func:`range` calls with :class:`list`.
pl: Zamienia :func:`xrange` na :func:`range` i opakowuje istniejące wywołania :func:`range` za pomocą :class:`list`.

source: Changes ``for x in file.xreadlines()`` to ``for x in file``.
pl: Zamienia ``for x in file.xreadlines()`` na ``for x in file``.

source: Wraps :func:`zip` usage in a :class:`list` call. This is disabled when ``from future_builtins import zip`` appears.
pl: Opakowuje użycie zadania :func:`zip` w wywołanie uogólnienia :class:`list`. To jest wyłączone gdy pojawia się ``from future_builtins import zip``.

source: :mod:`lib2to3` - 2to3's library
pl: :mod:`lib2to3` biblioteka 2to3

source: The :mod:`lib2to3` API should be considered unstable and may change drastically in the future.
pl: sprzęg (API) modułu :mod:`lib2to3` powinno być uważane za niestabilne i może się zmienić znacząco w przyszłości.

source: :mod:`__future__` --- Future statement definitions
pl: :mod:`__future__` --- Definicje przyszłych wyrażeń

source: :mod:`__future__` is a real module, and serves three purposes:
pl: :mod:`__future__` jest prawdziwym modułem, i służy trzem celom:

source: To avoid confusing existing tools that analyze import statements and expect to find the modules they're importing.
pl: Uniknąć pomylenia istniejących narzędzi które analizują wyrażenia importu i oczekiwać, że znajdzie moduł, który importuje.

source: To ensure that :ref:`future statements <future>` run under releases prior to 2.1 at least yield runtime exceptions (the import of :mod:`__future__` will fail, because there was no module of that name prior to 2.1).
pl: Zapewnić że :ref:`przyszłe wyrażenia <future>` uruchamiane pod wydaniami sprzed 2.1 przynajmniej dają wyjątki czasu wykonania (import :mod:`__future__ zawiedzie, gdyż nie było takiego modułu przed wersją 2.1).

source: To document when incompatible changes were introduced, and when they will be --- or were --- made mandatory. This is a form of executable documentation, and can be inspected programmatically via importing :mod:`__future__` and examining its contents.
pl: Dokumentować kiedy niezgodne zmiany zostały wprowadzone, i kiedy zostaną --- lub zostały --- obowiązujące. To jest forma dokumentacji programu, i może być sprawdzana programowo przez importowanie modułu :mod:`__future__` i przeegzaminowanie jego zawartości.

source: Each statement in :file:`__future__.py` is of the form::
pl: Każde wyrażenie w pliku :file:`__future__.py` jest w formie::

source: FeatureName = _Feature(OptionalRelease, MandatoryRelease, CompilerFlag)
pl: NazwaWłasności = _Feature(OptionalRelease, MandatoryRelease, CompilerFlag)

source: where, normally, *OptionalRelease* is less than *MandatoryRelease*, and both are 5-tuples of the same form as ``sys.version_info``::
pl: Gdzie, normalnie, *OpcjonalneWydanie* jest mniej niż *ObowiązkowymWydaniem*, i oba są 5-krotkami o tej samej formie jak ``sys.version_info``::

source: (PY_MAJOR_VERSION, # the 2 in 2.1.0a3; an int PY_MINOR_VERSION, # the 1; an int PY_MICRO_VERSION, # the 0; an int PY_RELEASE_LEVEL, # "alpha", "beta", "candidate" or "final"; string PY_RELEASE_SERIAL # the 3; an int )
pl: (PY_MAJOR_VERSION, # 2 w 2.1.0a3; liczba całkowita PY_MINOR_VERSION, # 1; liczba całkowita PY_MICRO_VERSION, # 0; liczba całkowita PY_RELEASE_LEVEL, # "alpha", "beta", "candidate" or "final"; ciąg znaków PY_RELEASE_SERIAL # 3; liczba całkowita )

source: *OptionalRelease* records the first release in which the feature was accepted.
pl: *OpcjonalneWydanie* zapamiętuje pierwsze wydanie w którym własność była zaakceptowana.

source: In the case of a *MandatoryRelease* that has not yet occurred, *MandatoryRelease* predicts the release in which the feature will become part of the language.
pl: W przypadku gdy *ObowiązkoweWydanie* jeszcze nie nastąpiło, *ObowiązkoweWydanie* przewiduje wydanie, w którym właściwość stanie się częścią języka.

source: Else *MandatoryRelease* records when the feature became part of the language; in releases at or after that, modules no longer need a future statement to use the feature in question, but may continue to use such imports.
pl: W przeciwnym razie *MandatoryRelease* zapisuje kiedy właściwość stała się częścią języka; w wydaniach w tym lub późniejszych, moduły nie potrzebują więcej określenia przyszłości aby używać własności o której jest mowa, ale mogą nadal używać takich importów.

source: *MandatoryRelease* may also be ``None``, meaning that a planned feature got dropped.
pl: *MandatoryRelease* może także być ``None``, w znaczeniu że planowana właściwość została pominięta.
